package com.test.ygdd.ui;

import java.util.Scanner;

/**
 * 공통 UI 클래스
 */
public class CommonUI {

	/**
	 * 메인화면 UI 출력 메서드
	 */
	public static void mainMenu() {
		//초기화면
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("		   🍔 요기담다 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔐 로그인	·····························	[1]");
		System.out.println("🗝️ 회원가입	·····························	[2]");
		System.out.println("🔍 아이디/비밀번호 찾기	·····················	[3]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("		      🔚 EXIT ");
		System.out.println("🔚 프로그램 종료	·····················	[4]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("* 원하시는 메뉴의 번호를 입력해 주세요!");
		 
	}
	/**
	 * 상단 타이틀 UI 출력 메서드
	 * @param title
	 */
	public static void header(String title) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.printf("		   🍔 %s 🍟\r\n", title);
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 하단 UI 출력 메서드
	 */
	public static void footer() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 하단 기타 정보 UI 출력 메서드
	 * @param information
	 */
	public static void infoFooter(String information) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("* " + information);
	}
	/**
	 * 사용자 입력 대기 출력 UI 출력 메서드
	 */
	public static void pause() {
		
		Scanner scan = new Scanner(System.in);
		
		System.out.println();
		System.out.println("계속하려면 엔터를 치세요.");
		scan.nextLine();
	}
}
