package com.test.ygdd.ui;

/**
 * 삭제 UI 클래스
 */
public class DeleteUI {
	/**
	 * 삭제 동의 UI 출력 메서드
	 */
	public static void deleteAgreeFooter() {
		System.out.println("* 삭제하시겠습니까? (Y/N)");
		System.out.println("🙆‍♂️ 삭제		······························· [Y]");
		System.out.println("🔙 뒤로가기	······························· [N]");
		System.out.println("═════════════════════════════════════════════════════"); 
	}
	/**
	 * 삭제 완료 UI 출력 메서드
	 */
	public static void deleteFinish() {
		CommonUI.header("삭제 완료");
		System.out.println("* 삭제가 완료되었습니다!");
		System.out.println("* 장바구니로 돌아가시려면 엔터를 눌러주세요");
	}

}
