package com.test.ygdd.ui;

import java.util.ArrayList;

import com.test.ygdd.data.Category;
import com.test.ygdd.data.Data;

/**
 * 일반회원 메뉴 관련 UI 클래스
 */
public class GeneralUserUI {
	
	/**
	 * 마이페이지 메뉴 UI 출력 메서드
	 */
	public static void optMyPage() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	          🍔 마이페이지 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("주문 목록	·····························	[1]");
		System.out.println("리뷰 쓰기	·····························	[2]");
		System.out.println("리뷰 관리	·····························	[3]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 음식 카테고리 UI 출력 메서드
	 */
	public static void optFoodCategory() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	       🍔 음식 카테고리 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		int index = 0; 
		for (Category c : Data.categoryList) {
			System.out.printf("%d. %s\n", index + 1, c.getCategoryName());
			
			index++;
		}
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("* 원하시는 카테고리의 번호를 입력해 주세요!");
	}
	/**
	 * 주문하기 UI 출력 메서드
	 * @param contents
	 */
	public static void optOrder(ArrayList<String> contents) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	       🍔 주문하기 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		for (String content : contents) {
			System.out.println(content);
		}
		System.out.println();
		System.out.println("💸 결제하기	·····························	[1]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("* 원하시는 카테고리의 번호를 입력해 주세요!");
	}
}
