package com.test.ygdd.ui;

import java.util.ArrayList;

/**
 * 주문 관련 UI 클래스
 */
public class OrderUI {
	
	/**
	 * 장바구니 화면 UI 출력 메서드
	 * @param contents
	 */
	public static void optCart(ArrayList<String> contents) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	           🍔 장바구니 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		for (String content : contents) {
			System.out.println(content);
		}
		System.out.println();
		System.out.println("주문하기	·····························	[1]");
		System.out.println("삭제하기	·····························	[2]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 주문 삭제 UI 출력 메서드
	 * @param contents
	 * @param count
	 */
	public static void optCartDelete(ArrayList<String> contents, int count) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	           🍔 삭제하기 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		if (count != 0) {
			for (String content : contents) {
				System.out.println(content);
			}
			System.out.println();
			System.out.println("전체 삭제하기	·····························	[D]");
		} else {
			System.out.println("* 삭제할 음식이 없습니다.");
			System.out.println();
		}
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════"); 
	}
}
