package com.test.ygdd.ui;

import java.util.ArrayList;

/**
 * 가맹점회원 메뉴 관련 UI 클래스
 */
public class StoreUserUI {
	
	/**
	 * 주문 수락/거절 리스트 UI 출력 메서드
	 * @param contents
	 */
	public static void optAgreeFoodList(ArrayList<String> contents) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	  🍔 주문 수락/거절 음식 리스트 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		int idx = 1;
		for (String content : contents) {
			System.out.printf("%d. %s\n", idx, content);
			idx++;
		}
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("* 원하시는 메뉴의 번호를 입력해 주세요!");
		
	}
	/**
	 * 주문 수락/거절 화면 UI 출력 메서드
	 */
	public static void optAgreeOrder() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	          🍔 주문 수락/거절 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("주문 수락	·····························	[1]");
		System.out.println("주문 거절	·····························	[2]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 점포 관리 메뉴 화면 UI 출력 메서드
	 */
	public static void optStoreManagement() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	           🍔 점포 관리 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("리뷰 관리	·····························	[1]");
		System.out.println("매출 확인	·····························	[2]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 가게 리뷰 관리 화면 UI 출력 메서드
	 * @param rating
	 * @param contents
	 */
	public static void optReviewManagement(double rating, ArrayList<String> contents) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	           🍔 리뷰 관리 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.printf("전체 평점 ★%.1f\n", rating);
		int idx = 1;
		for (String content : contents) {
			System.out.printf("%d. %s\n", idx, content);
			idx++;
		}
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("* 원하시는 리뷰의 번호를 입력해 주세요!");
	}
	/**
	 * 가게 리뷰 확인 화면 UI 출력 메서드
	 * @param contents
	 */
	public static void optShowReviewDatail(ArrayList<String> contents) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	           🍔 리뷰 보기 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		for (String content : contents) {
			System.out.printf("%s\n", content);
		}
		System.out.println("리뷰 삭제	·····························	[1]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 매출 확인 화면 UI 출력 메서드
	 * @param storeName
	 * @param sales
	 */
	public static void showStoreSales(String storeName, int sales) {
		//B02-05. 점포 관리 화면
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	           🍔 매출 확인 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.printf("[ %s ]\n", storeName);
		System.out.printf("전체 매출  ₩ %,d원\n", sales);
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
}
