package com.test.ygdd.ui;

import java.util.ArrayList;

/**
 * 가게 정보 관련 UI 클래스
 */
public class StoreUI {

	/**
	 * 가게 정보 UI 출력 메서드
	 * @param storeName
	 */
	public static void optStoreInfo(String storeName) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.printf("	           🍔 %s 🍟\n",storeName);
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("음식 보기	·····························	[1]");
		System.out.println("리뷰 보기(평점)	·····························	[2]");
		System.out.println("가게 정보	·····························	[3]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 음식 메뉴 보기 UI 출력 메서드
	 * @param contents
	 */
	public static void optMenuSelect(ArrayList<String> contents) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	           🍔 음식 보기 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		for (String content : contents) {
			System.out.println(content);
		}
		System.out.println();
		System.out.println("장바구니 이동	·······························	[C]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 리뷰 보기 UI 출력 메서드
	 */
	public static void storeReviewCheck() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	······························· [0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 가게 상세 정보 UI 출력 메서드
	 */
	public static void storeDetailInfo() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	······························· [0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
}
