package com.test.ygdd.ui;

import com.test.ygdd.data.Category;
import com.test.ygdd.data.Data;

/**
 * 로그인 관련 UI 클래스
 */
public class UserUI {

	/**
	 * 로그인 메뉴 화면 UI 출력 메서드
	 */
	public static void optLogin() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("		🍔 요기담다 로그인 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("		      🔐 LOGIN");
		System.out.println("👤 일반 회원 로그인  	·····················	[1]");
		System.out.println("🏪 가맹점 회원 로그인	·····················	[2]");
		System.out.println("🔍 아이디/비밀번호 찾기	·····················	[3]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기  	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 로그인 실패 UI 출력 메서드
	 */
	public static void optLoginFail() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("		🍔 로그인 실패 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("* 아이디 또는 비밀번호를 잘못 입력하였습니다.");
		System.out.println();
		System.out.println("다시 입력하기  	·····························	[1]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기  	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 아이디/비밀번호 찾기 메뉴 화면 UI 출력 메서드
	 */
	public static void optFindIdPw() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	      🍔 아이디/비밀번호 찾기 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("아이디 찾기  	·····························	[1]");
		System.out.println("비밀번호 찾기	·····························	[2]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기  	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 회원 가입 메뉴 UI 출력 메서드
	 */
	public static void optJoin() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	       🍔 요기담다 회원가입 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("👤 일반 회원	·····························	[1]");
		System.out.println("🏪 가맹점 회원	·····························	[2]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기  	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 가맹점회원 가입 시 카테고리 선택 화면 UI 출력 메서드
	 */
	public static void optJoinStoreCategory() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	          🍔 카테고리 선택 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("해당하는 카테고리의 코드를 선택하세요: ");
		for (Category cg : Data.categoryList) {
			//카테고리 리스트 불러오기
			System.out.printf("%s : %s \r\n", cg.getCategoryCode(), cg.getCategoryName());
		}
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 일반 회원 메뉴 화면 UI 출력 메서드
	 */
	public static void optGeneralUser() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	       🍔 일반 회원 메뉴 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("음식 카테고리	·····························	[1]");
		System.out.println("장바구니		·····························	[2]");
		System.out.println("마이페이지	·····························	[3]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔚 로그아웃	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 가맹점 회원 메뉴 화면 UI 출력 메서드
	 * @param count
	 */
	public static void optStoreUser(int count) {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	       🍔 가맹점 회원 메뉴 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("메뉴 등록	·····························	[1]");
		System.out.println("메뉴 수정	·····························	[2]");
		System.out.println("메뉴 삭제	·····························	[3]");
		System.out.printf("주문 수락/거절(%d)	·····················	[4]\n", count);
		System.out.println("점포관리 	·····························	[5]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 로그아웃	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 아이디/가맹점코드  찾기 화면 UI 출력 메서드
	 */
	public static void optSelectId() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	     🍔 아이디/가맹점코드 찾기 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔍 일반 회원 아이디 찾기  ····················	[1]");
		System.out.println("🔍 가맹점 회원 가맹점 코드 찾기  ·············	[2]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기  	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
	/**
	 * 비밀번호 찾기 화면 UI 출력 메서드
	 */
	public static void optSelectPw() {
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("	         🍔 비밀번호 찾기 🍟");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔍 일반 회원 비밀번호 찾기  ··················   [1]");
		System.out.println("🔍 가맹점 회원 비밀번호 찾기  ················   [2]");
		System.out.println("═════════════════════════════════════════════════════");
		System.out.println("🔙 뒤로가기	·····························	[0]");
		System.out.println("═════════════════════════════════════════════════════");
	}
}
